/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
Path : 
	Chapter 04. 객체 지향
	01. 객체 지향의 개요
Description : 
	01. 객체의 개념 : 현실 세계의 객체를 필드와 메서드로 모델리한 것
	02. 절차 지향과 객체 지향 
		01] 절차 지향 : 명령어의 순서와 흐름에 중점
		02] 객체 지향 : 많은 물체의 상호작용에 중점
	03. 객체와 클래스
		01] 클래스 : 설계도
		02] 객체 : 제품
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/
package ch04;

public class _01_01_OOP_Outline {

}
