/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
Path : 
	Chapter 04. 객체 지향
	02. 객체 지향 프로그래밍의 특징
Description : 
	01. 캡슐화 : 정보은닉. 내부 데이터를 외부로부터 보호
	02. 상속 : 부모 클래스의 메서드와 필드를 재활용
	03. 다형성 : 대입되는 객체에 따라서 메서드를 다르게 동작하도록 구현하는 기술. 동일한 명령을 내리더라도 객체의 종류에 따라 다르게 실행되는 특성
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/
package ch04;

public class _04_02_01_OOP_Features {

}
