/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
Path : 
	Chapter 03. 제어문과 메서드
	프로그래밍 문제 05. 직각삼각형의 각 변의 길이 구하기
Description : 
	01. 피타고라스 정리를 이용하고 for 문을 중첩해서 사용한다.
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/
package ch03;

public class _03_Programming05_RightTriangle {

	public static void main(String[] args) {
		
		for (int a = 1; a <= 20; a++) {
			
			for (int b = 1; b <= 20; b++) {
				
				for (int c = 1; c <= 20; c++) {
					
					if (a + b + c <= 20 && a*a + b*b == c*c) {
						System.out.printf("a : %d\t\tb : %d\t\tc : %d\n", a, b, c);
					}
					
				}
				
			}
			
		}
		
	}
}
