/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
Path : 
	Chapter 03. 제어문과 메서드
	06 메서드 04 메서드 매개변수 활용
Description : 
	01. 인수와 매개변수의 관계
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/
package ch03;

public class _06_04_EchoDemo {

	public static void main(String[] args) {
		
		echo("안녕", 3);// 인수
		
	}
	
	
	
	public static void echo(String s, int n) {// 매개변수
		for (int i = 0; i < n; i++)
			System.out.println(s);
	}
	
}
