/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
Path : 
	Chapter 02. 자바 프로그램 구조와 기초 문법
	01 자바 프로그램 기본 구조
Description : 
	01. 자바 프로그램 기본 구조
		클래스----------------------------------
		|	프로그램 개발 단위.
		|		메서드------------------------------
		|		|	수행할 작업을 나열한 코드 모음
		|		|		실행문--------------------------
		|		|		|	변수 선언, 값 저장, 메서드 호출 등
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
*/
package ch02;

// 클래스
public class _01_01_Hello {
	
	// 메서드
	public static void main(String[] args) {
		
		// 실행문
		System.out.println("안녕!");
		
		System.out.println("안녕" + "!");
		
		String hello = "안녕!";
		System.out.println(hello);
		System.out.println();
	}
}
